#include <stdio.h>
int main() {
    system("chcp 65001");
    //100以内的素数
    int q = 0, i = 4, j = 0, n[25] = {2, 3, 5, 7, 11, 13, 17, 19, 23, 29,
                                      31, 37, 41, 43, 47, 53, 59, 61, 67, 71,
                                      73, 79, 83, 89, 97};
    //从4开始 自增2
    for (i = 4; i < 101; i = i + 2) {
        for (j = 0; j <= 24; j++) {
            int c = i - n[j];
            //判断某个数减去一个素数后差是否为素食
            for (int k = 0; k <= 24; k++) {
                //当输入的数减去某一个素数得到的差仍为素数就判断成立并跳出
                //若否则K自增换一个差比较
                if (c == n[k]) {
                    q = 1;
                    break;
                }

            }
            //当q以1传出说明验证成立跳出换一个数验证
            if (q == 1)
                break;
            //当q以0传输出来说明减第一个数不对，换被减数

        }
        //若以0传出说明对比完仍不成立
        if(q==0)
            break;

    }
    //验证是否执行到了100的判断
    printf("%d ",i);
    if (q == 1)
        printf("哥德巴赫猜想100以内正确。\n");
    if (q == 0)
        printf("哥德巴赫猜想100以内错误。\n");
    return 0;
}