//
// Created by 14212 on 2023/11/20.
//

#ifndef C2023_CHALLENGE_JUDGE_FUNCTION_H
#define C2023_CHALLENGE_JUDGE_FUNCTION_H
int judge[100][10]={{0},//棋谱从分数由高到低依次排序，一旦搜索到一种棋谱则直接跳出，每组数据的第一个数表示检测棋谱的个数，剩下的数表示棋谱，其中1表示己方，-1表示对方或者堵死，0表示空格，2表示随意
                    //在设计棋盘的时候，1表示玩家，-1表示电脑，0表示空格，3表示墙
                    {6,2,1,1,1,1,1},//    连五
                    {6,0,1,1,1,1,0},//    活四
                    {6,0,1,1,1,1,-1},//    冲四
                    {6,2,1,1,0,1,1},
                    {6,2,1,1,1,0,1},
                    {6,0,1,1,1,0,0},//     活三
                    {6,0,1,1,0,1,0},
                    {6,0,1,1,1,0,-1},//   眠三
                    {5,0,1,1,1,-1},
                    {6,-1,1,1,1,0,0},
                    {6,2,1,1,0,0,1},
                    {6,0,1,1,0,1,-1},
                    {6,-1,1,1,0,1,0},
                    {6,0,1,1,0,0,0},//    活二
                    {6,0,1,1,0,0,-1},
                    {5,0,1,1,0,-1},
                    {6,0,1,0,0,1,0},
                    {5,0,1,0,1,0},
                    {4,0,1,1,-1},//               眠二
                    {6,-1,1,1,0,0,0},
                    {6,0,1,0,0,1,-1},
                    {5,0,1,0,1,-1},
                    {3,0,1,0},//                       活一
                    {3,0,1,-1}//                       死一
                    };
int scores[11]={0,100000000,10000000,10000,10000,100,100,10,10,1};
#define MODE_NUMBER 24
#endif //C2023_CHALLENGE_JUDGE_FUNCTION_H
